АлогистикТест2/src/DataProcessors/алк_РМ_ПривязкаПакетовКАддендуму_2_0/алк_РМ_ПривязкаПакетовКАддендуму_2_0.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>алк_РМ_ПривязкаПакетовКАддендуму_2_0</name>
  <attributes>
    <name>Аддендум</name>
    <type>
      <types>DocumentRef.алк_Аддендумы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>CatalogRef.алк_ОперацииПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Пакеты</name>
    <attributes>
      <name>Количество1</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Новый</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Произведено</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Привязано</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Отгружено</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>НаСкладе</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

АлогистикТест2/src/AccumulationRegisters/алк_ОстаткиЗапасов/алк_ОстаткиЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_ОстаткиЗапасов</name>
  <resources>
    <name>Количество</name>
    <comment>Для пиловочника и пилмата это объем, для ДГ это вес</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штабель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/InformationRegisters/алк_ПакетыПоАддендумам/алк_ПакетыПоАддендумам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПакетыПоАддендумам</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Аддендум</name>
    <type>
      <types>DocumentRef.алк_Аддендумы</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>DefinedType.алк_Количество</types>
    </type>
  </attributes>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПоОтгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Documents/алк_Аддендумы/алк_Аддендумы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_Аддендумы</name>
  <comment>Уточнение договора на поставку товаров клиенту</comment>
  <registerRecords>AccumulationRegister.алк_Аддендумы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.алк_СтатусыАддендума</types>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемыйСрокПроизводства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемыйСрокОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодУсловийПоставки</name>
    <type>
      <types>CatalogRef.алк_УсловияПоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерАддендума</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАддендума</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзмененияЗапрещены</name>
    <comment>Устанавливают после регистрации в ЛесЕГАИС</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подписан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтгрузкаРазрешена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>127</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеВручную</name>
      <comment>Если Да - пользователь вводит руками, если нет - перезаполняется по нашим алгоритмам</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияПЭО</name>
      <type>
        <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставТоваров</name>
    <attributes>
      <name>ИдентификаторТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Порода</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сорт</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
    <attributes>
      <name>ШиринаОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШиринаДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТолщинаОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТолщинаДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДлинаОт</name>
      <comment>Длина в миллиметрах</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДлинаДо</name>
      <comment>Длина в миллиметрах</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВлажностьОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВлажностьДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантПрипуска</name>
      <type>
        <types>CatalogRef.алк_ВариантыПрипуска</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ДиаметрОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДиаметрДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Documents/алк_ПривязкаПакетовКАддендуму/алк_ПривязкаПакетовКАддендуму.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ПривязкаПакетовКАддендуму</name>
  <registerRecords>AccumulationRegister.алк_Аддендумы</registerRecords>
  <registerRecords>InformationRegister.алк_ПакетыПоАддендумам</registerRecords>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>Производство</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </attributes>
  <attributes>
    <name>АддендумНовый</name>
    <type>
      <types>DocumentRef.алк_Аддендумы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторТовараНовый</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АддендумСтарый</name>
    <comment>Аддендум от которого отвязываем</comment>
    <type>
      <types>DocumentRef.алк_Аддендумы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторТовараСтарый</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

АлогистикТест2/src/DataProcessors/алк_РМ_ПривязкаПакетовКАддендуму_2_0/Forms/Форма/Module.bsl
#Область СобытияФормы 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
	Если ПроверитьЗаполнение() Тогда	
		АддендумПриИзмененииНаСервере();  
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УчастокПриИзменении(Элемент)

	ПриОткрытииНаСервере(); 
	Если ЗначениеЗаполнено(Объект.Номенклатура) И ЗначениеЗаполнено(Объект.Аддендум) Тогда 
		Если Объект.Номенклатура <> ПолучитьНоменклатуруИзАддендума(Объект.Аддендум) Тогда 
			Объект.Аддендум = ПредопределенноеЗначение("Документ.алк_Аддендумы.ПустаяСсылка"); 
		КонецЕсли;
	КонецЕсли; 	
	
	АддендумПриИзмененииНаСервере(); 

КонецПроцедуры   

&НаКлиенте
Процедура АддендумПриИзменении(Элемент)
	Если ПроверитьЗаполнение() Тогда	
		АддендумПриИзмененииНаСервере();
	КонецЕсли;
КонецПроцедуры   

&НаКлиенте
Процедура КарандашиПриИзменении(Элемент)
	Если ПроверитьЗаполнение() Тогда	
		АддендумПриИзмененииНаСервере();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ДобавляемыеПакетыНомерПакетаПриИзменении(Элемент) 
	
	Если НЕ ЗначениеЗаполнено(Маска) ИЛИ НЕ ЗначениеЗаполнено(ГодПакета) Тогда 
		Если НЕ ЗначениеЗаполнено(Маска) Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить префикс для определения серийного номера пакета!",,"Маска"); 
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ГодПакета) Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить период пакета для определения серийного номера пакета!",,"ГодПакета"); 
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.ДобавляемыеПакеты.ТекущиеДанные;
	НомерПакета = ТекДанные.НомерПакета;
	
	ПриИзмененииНомераПакета(Истина,НомерПакета,ТекДанные.НомерСтроки);
					
КонецПроцедуры

&НаКлиенте
Процедура ДобавляемыеПакетыСерийныйНомерПриИзменении(Элемент)
	ТекДанные = Элементы.ДобавляемыеПакеты.ТекущиеДанные;
	СерийныйНомер = ТекДанные.СерийныйНомер; 
	
	ПриИзмененииНомераПакета(Ложь,СерийныйНомер,ТекДанные.НомерСтроки);
КонецПроцедуры

&НаКлиенте
Процедура МаскаПриИзменении(Элемент)
	
	Если НЕ ДобавляемыеПакеты.Количество() = 0 Тогда 
		ПоказатьВопрос(Новый ОписаниеОповещения("ПриИзмененииМаски",ЭтотОбъект),"Табличная часть будет очищена! Продолжить?",РежимДиалогаВопрос.ОКОтмена);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГодПакетаПриИзменении(Элемент)
	Если НЕ ДобавляемыеПакеты.Количество() = 0 Тогда 
		ПоказатьВопрос(Новый ОписаниеОповещения("ПриИзмененииМаски",ЭтотОбъект),"Табличная часть будет очищена! Продолжить?",РежимДиалогаВопрос.ОКОтмена);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АддендумНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		
	НастройкиКомпоновки = Новый НастройкиКомпоновкиДанных;  
	
	ЭлементОтбора = НастройкиКомпоновки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Товары.Номенклатура");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ПравоеЗначение = ВернутьСписокНомеменклатур(); 
	
	ПараметрыВыбораФ = Новый Структура;
	ПараметрыВыбораФ.Вставить("ФиксированныеНастройки", НастройкиКомпоновки);
	ПараметрыВыбораФ.Вставить("РежимВыбора",Истина);
	ПараметрыВыбораФ.Вставить("МножественныйВыбор",Ложь); 
	
	ОткрытьФорму("Документ.алк_Аддендумы.ФормаВыбора",ПараметрыВыбораФ,
	Элемент, , , ,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ДобавляемыеПакетыПередУдалением(Элемент, Отказ)
	ТекДанные = Элементы.ДобавляемыеПакеты.ТекущиеДанные;
	ИндексСтроки = ДобавляемыеПакеты.Индекс(ТекДанные);
	
	Для Счетчик = ИндексСтроки ПО ДобавляемыеПакеты.Количество()-1 Цикл
		ДобавляемыеПакеты[Счетчик].НомерСтроки = Счетчик;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДобавляемыеПакетыПриИзменении(Элемент)  
	ТекДанные = Элементы.ДобавляемыеПакеты.ТекущиеДанные; 
	Если ТекДанные = Неопределено Тогда  
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ТекДанные.НомерСтроки) Тогда  
		ТекДанные.НомерСтроки = ДобавляемыеПакеты.Индекс(ТекДанные) + 1;  
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.алк_Перемещение") 
		ИЛИ ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.алк_ПеремещениеЗапасов")
		ИЛИ ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.алк_Производство") Тогда  
		Возврат;
	КонецЕсли;
	
	Для Каждого Пакет Из ВыбранноеЗначение Цикл			
			НовыйПакет = ДобавляемыеПакеты.Добавить();
			НомерСтроки = ДобавляемыеПакеты.Индекс(НовыйПакет)+1;
			НовыйПакет.НомерСтроки = НомерСтроки;
			НовыйПакет.СерийныйНомер = Пакет; 
			ПриИзмененииНомераПакета(Ложь,НовыйПакет.СерийныйНомер,НомерСтроки);	 
	КонецЦикла;
	
	ПересчитатьИтогДобавляемыхПакетов();
	
	Модифицированность = Истина;

КонецПроцедуры  

&НаКлиенте
Процедура ДобавляемыеПакетыПослеУдаления(Элемент)
	ПересчитатьИтогДобавляемыхПакетов();
КонецПроцедуры


#КонецОбласти


#Область Процедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Участок) Тогда
		//Заполним ДатаСмены и Смена автоматом
		ПараметрыСменыПоТекущейДате = РфпПолучениеДанныхСервер.ПолучитьПараметрыСменыПоДате(Объект.Участок);
		
		Если ПараметрыСменыПоТекущейДате = NULL Тогда
			Объект.Участок = Справочники.алк_Участки.ПустаяСсылка();
			Возврат;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Объект, ПараметрыСменыПоТекущейДате, "ДатаСмены, Смена");		
	КонецЕсли;
	
	Объект.Операция = Справочники.алк_ОперацииПроизводства.Отгрузка;
	Объект.Номенклатура = Объект.Участок.НоменклатураСписания; 
	Карандаши = 2;

КонецПроцедуры 

//проверить правильность получения последних привязанных сн  
&НаСервере
Процедура АддендумПриИзмененииНаСервере() 
		
	Объект.Пакеты.Очистить();      
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_АддендумыТовары.Ссылка КАК Ссылка,
		|	СУММА(алк_АддендумыТовары.Количество) КАК Количество,
		|	алк_АддендумыТовары.Ссылка.Статус КАК Статус
		|ИЗ
		|	Документ.алк_Аддендумы.Товары КАК алк_АддендумыТовары
		|ГДЕ
		|	алк_АддендумыТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_АддендумыТовары.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Аддендум);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	
	СтрокаОбъемАддендума = "";
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаОбъемАддендума = "Общий объем аддендума: " + ВыборкаДетальныеЗаписи.Количество + " м3. Статус: " + ВыборкаДетальныеЗаписи.Статус;
	КонецЦикла;

	
	//Заполним уже привязаные пакеты, исключая отвязанные
	Запрос = Новый Запрос;
	
	#Область СтарыЗапрос 
      	
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	алк_ПакетыПоАддендумамСрезПоследних.СерийныйНомер,
	//	|	СУММА(ВЫБОР
	//	|			КОГДА алк_ПакетыПоАддендумамСрезПоследних.ПоОтгрузке
	//	|				ТОГДА алк_ПакетыПоАддендумамСрезПоследних.Количество
	//	|			ИНАЧЕ 0
	//	|		КОНЕЦ) КАК Отгружено,
	//	|	СУММА(ВЫБОР
	//	|			КОГДА НЕ алк_ПакетыПоАддендумамСрезПоследних.ПоОтгрузке
	//	|				ТОГДА алк_ПакетыПоАддендумамСрезПоследних.Количество
	//	|			ИНАЧЕ 0
	//	|		КОНЕЦ) КАК Количество,
	//	|	ЛОЖЬ КАК Новый,
	//	|	алк_ПакетыПоАддендумамСрезПоследних.Характеристика
	//	|ИЗ
	//	|	РегистрСведений.алк_ПакетыПоАддендумам.СрезПоследних(, Аддендум = &Аддендум) КАК алк_ПакетыПоАддендумамСрезПоследних
	//	|ГДЕ
	//	|	НЕ алк_ПакетыПоАддендумамСрезПоследних.СерийныйНомер В
	//	|				(ВЫБРАТЬ
	//	|					ВложенныйЗапрос.СерийныйНомер
	//	|				ИЗ
	//	|					(ВЫБРАТЬ ПЕРВЫЕ 1
	//	|						алк_ПакетыПоАддендумамСрезПоследних.СерийныйНомер КАК СерийныйНомер,
	//	|						алк_ПакетыПоАддендумамСрезПоследних.Аддендум КАК Аддендум
	//	|					ИЗ
	//	|						РегистрСведений.алк_ПакетыПоАддендумам.СрезПоследних(, СерийныйНомер В
	//	|							(ВЫБРАТЬ
	//	|								алк_ПакетыПоАддендумамСрезПоследних.СерийныйНомер
	//	|							ИЗ
	//	|								РегистрСведений.алк_ПакетыПоАддендумам.СрезПоследних(, Аддендум = &Аддендум) КАК алк_ПакетыПоАддендумамСрезПоследних)) КАК алк_ПакетыПоАддендумамСрезПоследних
	//	|					УПОРЯДОЧИТЬ ПО
	//	|						алк_ПакетыПоАддендумамСрезПоследних.Период УБЫВ) КАК ВложенныйЗапрос
	//	|				ГДЕ
	//	|					НЕ ВложенныйЗапрос.Аддендум = &Аддендум)
	//	|	И алк_ПакетыПоАддендумамСрезПоследних.СерийныйНомер.Владелец В(&Номенклатуры)
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	алк_ПакетыПоАддендумамСрезПоследних.СерийныйНомер,
	//	|	алк_ПакетыПоАддендумамСрезПоследних.Характеристика"; 
	//
	#КонецОбласти 
		
 #Область Запрос1
 	
 
	//
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	алк_ПакетыПоАддендумам.СерийныйНомер КАК СерийныйНомер,
	//	|	алк_ПакетыПоАддендумам.Аддендум КАК Аддендум,
	//	|	алк_ПакетыПоАддендумам.ИдентификаторТовара КАК ИдентификаторТовара,
	//	|	1 КАК КоличествоПакетов
	//	|ПОМЕСТИТЬ ВТ_ПакетыПроизведены
	//	|ИЗ
	//	|	РегистрСведений.алк_ПакетыПоАддендумам КАК алк_ПакетыПоАддендумам
	//	|ГДЕ
	//	|	ВЫБОР
	//	|			КОГДА алк_ПакетыПоАддендумам.Регистратор ССЫЛКА Документ.алк_ПривязкаПакетовКАддендуму
	//	|				ТОГДА ВЫРАЗИТЬ(алк_ПакетыПоАддендумам.Регистратор КАК Документ.алк_ПривязкаПакетовКАддендуму).Производство
	//	|			ИНАЧЕ ЛОЖЬ
	//	|		КОНЕЦ
	//	|	И алк_ПакетыПоАддендумам.Аддендум = &Аддендум
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	алк_ПакетыПоАддендумамСрезПоследних.СерийныйНомер КАК СерийныйНомер,
	//	|	алк_ПакетыПоАддендумамСрезПоследних.Аддендум КАК Аддендум,
	//	|	алк_ПакетыПоАддендумамСрезПоследних.ИдентификаторТовара КАК ИдентификаторТовара,
	//	|	1 КАК КоличествоПакетов
	//	|ПОМЕСТИТЬ ВТ_ПакетыПривязаны
	//	|ИЗ
	//	|	РегистрСведений.алк_ПакетыПоАддендумам.СрезПоследних(, НЕ ПоОтгрузке) КАК алк_ПакетыПоАддендумамСрезПоследних
	//	|ГДЕ
	//	|	алк_ПакетыПоАддендумамСрезПоследних.Аддендум = &Аддендум
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	алк_ПакетыПоАддендумамСрезПоследних.СерийныйНомер КАК СерийныйНомер,
	//	|	алк_ПакетыПоАддендумамСрезПоследних.Аддендум КАК Аддендум,
	//	|	алк_ПакетыПоАддендумамСрезПоследних.ИдентификаторТовара КАК ИдентификаторТовара,
	//	|	1 КАК КоличествоПакетов
	//	|ПОМЕСТИТЬ ВТ_ПакетыОтгружены
	//	|ИЗ
	//	|	РегистрСведений.алк_ПакетыПоАддендумам.СрезПоследних(, ПоОтгрузке) КАК алк_ПакетыПоАддендумамСрезПоследних
	//	|ГДЕ
	//	|	алк_ПакетыПоАддендумамСрезПоследних.Аддендум = &Аддендум
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ_ПакетыПроизведены.СерийныйНомер КАК СерийныйНомер,
	//	|	ВТ_ПакетыПроизведены.КоличествоПакетов КАК Произведено,
	//	|	0 КАК Привязано,
	//	|	0 КАК Отгружено
	//	|ПОМЕСТИТЬ ВТ_Итог
	//	|ИЗ
	//	|	ВТ_ПакетыПроизведены КАК ВТ_ПакетыПроизведены
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	ВТ_ПакетыПривязаны.СерийныйНомер,
	//	|	0,
	//	|	ВТ_ПакетыПривязаны.КоличествоПакетов,
	//	|	0
	//	|ИЗ
	//	|	ВТ_ПакетыПривязаны КАК ВТ_ПакетыПривязаны
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	ВТ_ПакетыОтгружены.СерийныйНомер,
	//	|	0,
	//	|	0,
	//	|	ВТ_ПакетыОтгружены.КоличествоПакетов
	//	|ИЗ
	//	|	ВТ_ПакетыОтгружены КАК ВТ_ПакетыОтгружены
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ_Итог.СерийныйНомер КАК СерийныйНомер,
	//	|	МАКСИМУМ(ВТ_Итог.Произведено) КАК Произведено,
	//	|	МАКСИМУМ(ВТ_Итог.Привязано) КАК Привязано,
	//	|	МАКСИМУМ(ВТ_Итог.Отгружено) КАК Отгружено
	//	|ПОМЕСТИТЬ ВТ_Итог2
	//	|ИЗ
	//	|	ВТ_Итог КАК ВТ_Итог
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ВТ_Итог.СерийныйНомер
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	алк_ОстаткиЗапасовОбороты.СерийныйНомер КАК СерийныйНомер,
	//	|	СРЕДНЕЕ(алк_ОстаткиЗапасовОбороты.КоличествоПриход) КАК КоличествоПриход,
	//	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ алк_ОстаткиЗапасовОбороты.Регистратор) КАК Регистратор,
	//	|	МАКСИМУМ(алк_ОстаткиЗапасовОбороты.Период) КАК Период
	//	|ПОМЕСТИТЬ ВТ_ОбъемПериод
	//	|ИЗ
	//	|	РегистрНакопления.алк_ОстаткиЗапасов.Обороты(
	//	|			,
	//	|			,
	//	|			Регистратор,
	//	|			СерийныйНомер В
	//	|				(ВЫБРАТЬ
	//	|					ВТ_Итог2.СерийныйНомер КАК СерийныйНомер
	//	|				ИЗ
	//	|					ВТ_Итог2 КАК ВТ_Итог2)) КАК алк_ОстаткиЗапасовОбороты
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	алк_ОстаткиЗапасовОбороты.СерийныйНомер
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	алк_ОстаткиЗапасовОбороты.СерийныйНомер КАК СерийныйНомер,
	//	|	алк_ОстаткиЗапасовОбороты.Характеристика КАК Характеристика,
	//	|	алк_ОстаткиЗапасовОбороты.КоличествоПриход КАК КоличествоПриход
	//	|ПОМЕСТИТЬ ВТ_Объем
	//	|ИЗ
	//	|	ВТ_ОбъемПериод КАК ВТ_ОбъемПериод
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.алк_ОстаткиЗапасов.Обороты(
	//	|				,
	//	|				,
	//	|				Регистратор,
	//	|				СерийныйНомер В
	//	|					(ВЫБРАТЬ
	//	|						ВТ_Итог2.СерийныйНомер КАК СерийныйНомер
	//	|					ИЗ
	//	|						ВТ_Итог2 КАК ВТ_Итог2)) КАК алк_ОстаткиЗапасовОбороты
	//	|		ПО ВТ_ОбъемПериод.СерийныйНомер = алк_ОстаткиЗапасовОбороты.СерийныйНомер
	//	|			И ВТ_ОбъемПериод.Период = алк_ОстаткиЗапасовОбороты.Период
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ_Итог2.СерийныйНомер КАК СерийныйНомер,
	//	|	ВТ_Объем.Характеристика КАК Характеристика,
	//	|	ВТ_Итог2.Произведено * ВТ_Объем.КоличествоПриход КАК Произведено,
	//	|	ВТ_Итог2.Привязано * ВТ_Объем.КоличествоПриход КАК Привязано,
	//	|	ВТ_Итог2.Отгружено * ВТ_Объем.КоличествоПриход КАК Отгружено
	//	|ИЗ
	//	|	ВТ_Итог2 КАК ВТ_Итог2
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Объем КАК ВТ_Объем
	//	|		ПО ВТ_Итог2.СерийныйНомер = ВТ_Объем.СерийныйНомер
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	ВТ_Итог2.СерийныйНомер.Наименование"; 

	#КонецОбласти
	
		
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ОстаткиЗапасовОстатки.СерийныйНомер КАК СерийныйНомер
		|ПОМЕСТИТЬ ВТ_Остатки
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
		|			,
		|			Номенклатура В (&Номенклатура)
		|				И НЕ СерийныйНомер = ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка)) КАК алк_ОстаткиЗапасовОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ПакетыПоАддендумамСрезПоследних.СерийныйНомер КАК СерийныйНомер
		|ПОМЕСТИТЬ ВТ_ПакетыПривязанныеКАддендумамНаОстатках
		|ИЗ
		|	РегистрСведений.алк_ПакетыПоАддендумам.СрезПоследних(
		|			,
		|			Номенклатура В (&Номенклатура)
		|				И СерийныйНомер В
		|					(ВЫБРАТЬ
		|						ВТ_Остатки.СерийныйНомер КАК СерийныйНомер
		|					ИЗ
		|						ВТ_Остатки КАК ВТ_Остатки)) КАК алк_ПакетыПоАддендумамСрезПоследних
		|ГДЕ
		|	НЕ алк_ПакетыПоАддендумамСрезПоследних.Аддендум = ЗНАЧЕНИЕ(Документ.алк_Аддендумы.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ПакетыПоАддендумамСрезПоследних.СерийныйНомер КАК СерийныйНомер
		|ПОМЕСТИТЬ ВТ_ПакетыПривязанныеКВыбранномуАддендумуНаОстатках
		|ИЗ
		|	РегистрСведений.алк_ПакетыПоАддендумам.СрезПоследних(
		|			,
		|			Номенклатура В (&Номенклатура)
		|				И СерийныйНомер В
		|					(ВЫБРАТЬ
		|						ВТ_Остатки.СерийныйНомер КАК СерийныйНомер
		|					ИЗ
		|						ВТ_Остатки КАК ВТ_Остатки)) КАК алк_ПакетыПоАддендумамСрезПоследних
		|ГДЕ
		|	алк_ПакетыПоАддендумамСрезПоследних.Аддендум = &Аддендум
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Остатки.СерийныйНомер КАК СерийныйНомер,
		|	1 КАК КоличествоПакетов
		|ПОМЕСТИТЬ ВТ_ОстаткиБезАддендумов
		|ИЗ
		|	ВТ_Остатки КАК ВТ_Остатки
		|ГДЕ
		|	НЕ ВТ_Остатки.СерийныйНомер В
		|				(ВЫБРАТЬ
		|					ВТ_ПакетыПривязанныеКАддендумамНаОстатках.СерийныйНомер КАК СерийныйНомер
		|				ИЗ
		|					ВТ_ПакетыПривязанныеКАддендумамНаОстатках КАК ВТ_ПакетыПривязанныеКАддендумамНаОстатках)
		|	И ЗНАЧЕНИЕ(Документ.алк_Аддендумы.ПустаяСсылка) = &Аддендум
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Остатки.СерийныйНомер КАК СерийныйНомер,
		|	1 КАК КоличествоПакетов
		|ПОМЕСТИТЬ ВТ_ОстаткиПоВыбранномуАддендуму
		|ИЗ
		|	ВТ_Остатки КАК ВТ_Остатки
		|ГДЕ
		|	ВТ_Остатки.СерийныйНомер В
		|			(ВЫБРАТЬ
		|				ВТ_ПакетыПривязанныеКВыбранномуАддендумуНаОстатках.СерийныйНомер КАК СерийныйНомер
		|			ИЗ
		|				ВТ_ПакетыПривязанныеКВыбранномуАддендумуНаОстатках КАК ВТ_ПакетыПривязанныеКВыбранномуАддендумуНаОстатках)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ПакетыПоАддендумам.СерийныйНомер КАК СерийныйНомер,
		|	алк_ПакетыПоАддендумам.Аддендум КАК Аддендум,
		|	алк_ПакетыПоАддендумам.ИдентификаторТовара КАК ИдентификаторТовара,
		|	1 КАК КоличествоПакетов
		|ПОМЕСТИТЬ ВТ_ПакетыПроизведены
		|ИЗ
		|	РегистрСведений.алк_ПакетыПоАддендумам КАК алк_ПакетыПоАддендумам
		|ГДЕ
		|	ВЫБОР
		|			КОГДА алк_ПакетыПоАддендумам.Регистратор ССЫЛКА Документ.алк_ПривязкаПакетовКАддендуму
		|				ТОГДА ВЫРАЗИТЬ(алк_ПакетыПоАддендумам.Регистратор КАК Документ.алк_ПривязкаПакетовКАддендуму).Производство
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|	И алк_ПакетыПоАддендумам.Аддендум = &Аддендум
		|	И НЕ ЗНАЧЕНИЕ(Документ.алк_Аддендумы.ПустаяСсылка) = &Аддендум
		|	И алк_ПакетыПоАддендумам.СерийныйНомер.Владелец В(&Номенклатура)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ПакетыПоАддендумамСрезПоследних.СерийныйНомер КАК СерийныйНомер,
		|	алк_ПакетыПоАддендумамСрезПоследних.Аддендум КАК Аддендум,
		|	алк_ПакетыПоАддендумамСрезПоследних.ИдентификаторТовара КАК ИдентификаторТовара,
		|	1 КАК КоличествоПакетов
		|ПОМЕСТИТЬ ВТ_ПакетыПривязаны
		|ИЗ
		|	РегистрСведений.алк_ПакетыПоАддендумам.СрезПоследних(
		|			,
		|			Номенклатура В (&Номенклатура)
		|				И НЕ ПоОтгрузке
		|				И НЕ ЗНАЧЕНИЕ(Документ.алк_Аддендумы.ПустаяСсылка) = &Аддендум) КАК алк_ПакетыПоАддендумамСрезПоследних
		|ГДЕ
		|	алк_ПакетыПоАддендумамСрезПоследних.Аддендум = &Аддендум
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ПакетыПоАддендумамСрезПоследних.СерийныйНомер КАК СерийныйНомер,
		|	алк_ПакетыПоАддендумамСрезПоследних.Аддендум КАК Аддендум,
		|	алк_ПакетыПоАддендумамСрезПоследних.ИдентификаторТовара КАК ИдентификаторТовара,
		|	1 КАК КоличествоПакетов
		|ПОМЕСТИТЬ ВТ_ПакетыОтгружены
		|ИЗ
		|	РегистрСведений.алк_ПакетыПоАддендумам.СрезПоследних(
		|			,
		|			Номенклатура В (&Номенклатура)
		|				И ПоОтгрузке
		|				И НЕ ЗНАЧЕНИЕ(Документ.алк_Аддендумы.ПустаяСсылка) = &Аддендум
		|				И Аддендум = &Аддендум) КАК алк_ПакетыПоАддендумамСрезПоследних
		|ГДЕ
		|	алк_ПакетыПоАддендумамСрезПоследних.Аддендум = &Аддендум
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПакетыПроизведены.СерийныйНомер КАК СерийныйНомер,
		|	ВТ_ПакетыПроизведены.КоличествоПакетов КАК Произведено,
		|	0 КАК Привязано,
		|	0 КАК Отгружено,
		|	0 КАК НаСкладе
		|ПОМЕСТИТЬ ВТ_Итог
		|ИЗ
		|	ВТ_ПакетыПроизведены КАК ВТ_ПакетыПроизведены
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ПакетыПривязаны.СерийныйНомер,
		|	0,
		|	ВТ_ПакетыПривязаны.КоличествоПакетов,
		|	0,
		|	0
		|ИЗ
		|	ВТ_ПакетыПривязаны КАК ВТ_ПакетыПривязаны
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ПакетыОтгружены.СерийныйНомер,
		|	0,
		|	0,
		|	ВТ_ПакетыОтгружены.КоличествоПакетов,
		|	0
		|ИЗ
		|	ВТ_ПакетыОтгружены КАК ВТ_ПакетыОтгружены
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ОстаткиБезАддендумов.СерийныйНомер,
		|	0,
		|	0,
		|	0,
		|	ВТ_ОстаткиБезАддендумов.КоличествоПакетов
		|ИЗ
		|	ВТ_ОстаткиБезАддендумов КАК ВТ_ОстаткиБезАддендумов
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ОстаткиПоВыбранномуАддендуму.СерийныйНомер,
		|	0,
		|	0,
		|	0,
		|	ВТ_ОстаткиПоВыбранномуАддендуму.КоличествоПакетов
		|ИЗ
		|	ВТ_ОстаткиПоВыбранномуАддендуму КАК ВТ_ОстаткиПоВыбранномуАддендуму
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Итог.СерийныйНомер КАК СерийныйНомер,
		|	МАКСИМУМ(ВТ_Итог.Произведено) КАК Произведено,
		|	МАКСИМУМ(ВТ_Итог.Привязано) КАК Привязано,
		|	МАКСИМУМ(ВТ_Итог.Отгружено) КАК Отгружено,
		|	МАКСИМУМ(ВТ_Итог.НаСкладе) КАК НаСкладе
		|ПОМЕСТИТЬ ВТ_Итог2
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Итог.СерийныйНомер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ОстаткиЗапасовОбороты.СерийныйНомер КАК СерийныйНомер,
		|	СРЕДНЕЕ(алк_ОстаткиЗапасовОбороты.КоличествоПриход) КАК КоличествоПриход,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ алк_ОстаткиЗапасовОбороты.Регистратор) КАК Регистратор,
		|	МАКСИМУМ(алк_ОстаткиЗапасовОбороты.Период) КАК Период
		|ПОМЕСТИТЬ ВТ_ОбъемПериод
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Обороты(
		|			,
		|			,
		|			Регистратор,
		|			Номенклатура В (&Номенклатура)
		|				И СерийныйНомер В
		|					(ВЫБРАТЬ
		|						ВТ_Итог2.СерийныйНомер КАК СерийныйНомер
		|					ИЗ
		|						ВТ_Итог2 КАК ВТ_Итог2)) КАК алк_ОстаткиЗапасовОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ОстаткиЗапасовОбороты.СерийныйНомер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ОстаткиЗапасовОбороты.СерийныйНомер КАК СерийныйНомер,
		|	алк_ОстаткиЗапасовОбороты.Характеристика КАК Характеристика,
		|	алк_ОстаткиЗапасовОбороты.КоличествоПриход КАК КоличествоПриход
		|ПОМЕСТИТЬ ВТ_Объем
		|ИЗ
		|	ВТ_ОбъемПериод КАК ВТ_ОбъемПериод
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.алк_ОстаткиЗапасов.Обороты(
		|				,
		|				,
		|				Регистратор,
		|				Номенклатура В (&Номенклатура)
		|					И СерийныйНомер В
		|						(ВЫБРАТЬ
		|							ВТ_Итог2.СерийныйНомер КАК СерийныйНомер
		|						ИЗ
		|							ВТ_Итог2 КАК ВТ_Итог2)) КАК алк_ОстаткиЗапасовОбороты
		|		ПО ВТ_ОбъемПериод.СерийныйНомер = алк_ОстаткиЗапасовОбороты.СерийныйНомер
		|			И ВТ_ОбъемПериод.Период = алк_ОстаткиЗапасовОбороты.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Итог2.СерийныйНомер КАК СерийныйНомер,
		|	ВТ_Объем.Характеристика КАК Характеристика,
		|	ВТ_Итог2.Произведено * ВТ_Объем.КоличествоПриход КАК Произведено,
		|	ВТ_Итог2.Привязано * ВТ_Объем.КоличествоПриход КАК Привязано,
		|	ВТ_Итог2.Отгружено * ВТ_Объем.КоличествоПриход КАК Отгружено,
		|	ВТ_Итог2.НаСкладе * ВТ_Объем.КоличествоПриход КАК НаСкладе
		|ИЗ
		|	ВТ_Итог2 КАК ВТ_Итог2
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Объем КАК ВТ_Объем
		|		ПО ВТ_Итог2.СерийныйНомер = ВТ_Объем.СерийныйНомер
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ_Итог2.СерийныйНомер.Наименование"; 


	
	
	Запрос.УстановитьПараметр("Аддендум", Объект.Аддендум);
	Запрос.УстановитьПараметр("Номенклатура", ВернутьСписокНомеменклатур());
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрПакет = Объект.Пакеты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрПакет, ВыборкаДетальныеЗаписи);
	КонецЦикла; 
					
КонецПроцедуры
//\\

&НаКлиенте
Процедура РедактированиеФормыПриПередПривязкой(ПередПривязкой) 
	Элементы.ГруппаШапка.Доступность = НЕ ПередПривязкой;
	Элементы.Аддендум.Доступность = НЕ ПередПривязкой;
	Элементы.Пакеты.Видимость = НЕ ПередПривязкой; 
	Элементы.Маска.Видимость = ПередПривязкой;
	Элементы.ГодПакета.Видимость = ПередПривязкой;
	Элементы.ДобавляемыеПакеты.Видимость = ПередПривязкой; 
	Элементы.ГруппаКоманд.Видимость = ПередПривязкой;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДокументуКоманда(ЗаполнитьПоПеремещению,ЗаполнитьПоПеремещениюЗапасов) 
	Если НЕ ДобавляемыеПакеты.Количество() = 0 Тогда             
		ПараметрыЗаполнения = Новый Структура;
		ПараметрыЗаполнения.Вставить("ПоПеремещению",ЗаполнитьПоПеремещению);
		ПараметрыЗаполнения.Вставить("ПоПеремещениюЗапасов",ЗаполнитьПоПеремещениюЗапасов);
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗаполнениемТЧ",ЭтотОбъект,ПараметрыЗаполнения),"Табличная часть будет очищена! Продолжить?",РежимДиалогаВопрос.ОКОтмена);
		Возврат;
	КонецЕсли;
	ПерезаполнитьТЧ(ЗаполнитьПоПеремещению,ЗаполнитьПоПеремещениюЗапасов);
КонецПроцедуры    

&НаКлиенте
Процедура ПередЗаполнениемТЧ(Результат,ДопПараметры) Экспорт  
	
	Если НЕ Результат = КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	ДобавляемыеПакеты.Очистить();
	ПерезаполнитьТЧ(ДопПараметры.ПоПеремещению,ДопПараметры.ПоПеремещениюЗапасов);
			
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьТЧ(ПерезаполнитьПоПеремещению,ПерезаполнитьПоПеремещениюЗапасов)
	
	Если ПерезаполнитьПоПеремещению ИЛИ ПерезаполнитьПоПеремещениюЗапасов Тогда
		Если ПерезаполнитьПоПеремещениюЗапасов Тогда
			ИмяФормыДляОткрытия = "Документ.алк_ПеремещениеЗапасов.ФормаВыбора"; 
		Иначе 
			ИмяФормыДляОткрытия = "Документ.алк_Перемещение.ФормаВыбора"; 
		КонецЕсли;
		ИмяОтбора = "Запасы.Номенклатура"; 
	Иначе
		ИмяФормыДляОткрытия = "Документ.алк_Производство.ФормаВыбора";  
		ИмяОтбора = "Продукция.Номенклатура";	
	КонецЕсли;
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ПоПеремещению",ПерезаполнитьПоПеремещению); 
	ПараметрыЗаполнения.Вставить("ПоПеремещениюЗапасов",ПерезаполнитьПоПеремещениюЗапасов);
		
	НастройкиКомпоновки = Новый НастройкиКомпоновкиДанных;  
	
	ЭлементОтбора = НастройкиКомпоновки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяОтбора);
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ПравоеЗначение = ВернутьСписокНомеменклатур(); 
	
	ПараметрыВыбораФормы = Новый Структура;
	ПараметрыВыбораФормы.Вставить("ФиксированныеНастройки", НастройкиКомпоновки);
	ПараметрыВыбораФормы.Вставить("РежимВыбора",Истина);
	ПараметрыВыбораФормы.Вставить("МножественныйВыбор",Ложь); 

	ОткрытьФорму(ИмяФормыДляОткрытия,ПараметрыВыбораФормы,ЭтаФорма,,,,Новый ОписаниеОповещения("ОкончаниеВыбораДокументаКПерезаполнению",ЭтотОбъект,ПараметрыЗаполнения));
	
КонецПроцедуры 

&НаСервере
Процедура ОкончаниеВыбораДокументаКПерезаполнению(Результат,ДопПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;  
	
	Если ДопПараметры.ПоПеремещению ИЛИ ДопПараметры.ПоПеремещениюЗапасов  Тогда
		Если ДопПараметры.ПоПеремещению Тогда 
			ТЧ = Результат.Запасы.Выгрузить(,"СерийныйНомер,Характеристика,Количество"); 
		Иначе
			ТЧ = Результат.Запасы.Выгрузить(,"СерийныйНомер,Характеристика,Объем");   
			//придется переименовать колонку,чтобы загрузить быстро
			Запрос = Новый Запрос;
			Запрос.Текст ="ВЫБРАТЬ
			              |	ТЧ.СерийныйНомер,
			              |	ТЧ.Характеристика,
			              |	ТЧ.Объем
			              |ПОМЕСТИТЬ ВТ
			              |ИЗ
			              |	&ТЧ КАК ТЧ
			              |;
			              |
			              |////////////////////////////////////////////////////////////////////////////////
			              |ВЫБРАТЬ
			              |	ВТ.СерийныйНомер,
			              |	ВТ.Характеристика,
			              |	ВТ.Объем КАК Количество
			              |ИЗ
			              |	ВТ КАК ВТ";
			Запрос.УстановитьПараметр("ТЧ",ТЧ);
			ТЧ = Запрос.Выполнить().Выгрузить();
		КонецЕсли;	
	Иначе
		ТЧ = Результат.Продукция.Выгрузить(,"СерийныйНомер,Характеристика,Количество"); 	
	КонецЕсли;  
	
	ТЧ = ВернутьТЗСДаннымиПоАдд(ТЧ);
	
	ДобавляемыеПакеты.Загрузить(ТЧ);  
	
	НомерСтроки = 0;
	Для Каждого стр ИЗ ДобавляемыеПакеты Цикл
		стр.НомерСтроки = НомерСтроки + 1; 
		НомерСтроки = стр.НомерСтроки; 
	КонецЦикла;
		
	ПересчитатьИтогДобавляемыхПакетов(); 
	
	//проверка, если пакет уже привязан к этому адд или его нет на остатках   
	Контроль(ДобавляемыеПакеты.Выгрузить());
	//\\   
			
КонецПроцедуры

&НаСервере
Процедура ПересчитатьИтогДобавляемыхПакетов()
	Элементы.ДобавляемыеПакетыОбъем.ТекстПодвала = ДобавляемыеПакеты.Итог("Количество");	
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	
	Успех = Истина;
	
	НачатьТранзакцию(); 
	Попытка	
		Для Каждого Стр Из ДобавляемыеПакеты Цикл
				ПараметрыЗаполнения = Документы.алк_ПривязкаПакетовКАддендуму.ПолучитьСтруктуруЗаполнения_СоздатьДокумент();
				ПараметрыЗаполнения.Организация = Объект.Участок.Организация;
				ПараметрыЗаполнения.ДатаСмены = Объект.ДатаСмены;
				ПараметрыЗаполнения.Смена = Объект.Смена;
				ПараметрыЗаполнения.СерийныйНомер = Стр.СерийныйНомер;
				
				ПараметрыЗаполнения.АддендумНовый = Объект.Аддендум;
					
				ПараметрыЗаполнения.Ответственный = Пользователи.ТекущийПользователь();	
				
				НовыйДокументПривязкиКАддендуму = Документы.алк_ПривязкаПакетовКАддендуму.СоздатьДокумент();
				НовыйДокументПривязкиКАддендуму.Заполнить(ПараметрыЗаполнения);
				НовыйДокументПривязкиКАддендуму.АддендумСтарый = Стр.ТекущийАддендум;
				//НовыйДокументПривязкиКАддендуму.ИдентификаторТовараСтарый = Стр.ИдентификаторТовара; //идеентификаторы повторно присваиваются в доке
				
				НовыйДокументПривязкиКАддендуму.Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		Успех = Ложь;
		Сообщить(ОписаниеОшибки());
		ОтменитьТранзакцию();
		Возврат;
	КонецПопытки;
	
КонецПроцедуры 

&НаКлиенте
Процедура УспешннаяПривязкаКАдд() 
	
	АддендумПриИзмененииНаСервере();  
	
	//отметим добавленные пакеты
	Для Каждого стр ИЗ Объект.Пакеты Цикл 
		Если НЕ ДобавляемыеПакеты.НайтиСтроки(Новый Структура("СерийныйНомер",стр.СерийныйНомер)).Количество() = 0 Тогда 
			стр.Новый = Истина; 
		КонецЕсли;
	КонецЦикла; 
	//\\
	
	ОчиститьДобавялемыеПакетыИМаску();
	ПересчитатьИтогДобавляемыхПакетов();
	РедактированиеФормыПриПередПривязкой(Ложь);
	
КонецПроцедуры

//Проверяем есть ли на остатках и не привязан ли уже к этому адд
&НаСервере
Процедура Контроль(ТЧ,ПрошлаПроверкаУспешно=Истина) 
	
	Если ТЧ = Неопределено Тогда 
		ТЧ = ДобавляемыеПакеты.Выгрузить();
	КонецЕсли;
	
	////проверяем остатки
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ТЧ.СерийныйНомер
	//               |ПОМЕСТИТЬ ВТ
	//               |ИЗ
	//               |	&ТЧ КАК ТЧ
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	алк_ОстаткиЗапасовОстатки.СерийныйНомер,
	//               |	алк_ОстаткиЗапасовОстатки.КоличествоОстаток
	//               |ИЗ
	//               |	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
	//               |			,
	//               |			СерийныйНомер В
	//               |				(ВЫБРАТЬ
	//               |					ВТ.СерийныйНомер
	//               |				ИЗ
	//               |					ВТ КАК ВТ)) КАК алк_ОстаткиЗапасовОстатки";
	//Запрос.УстановитьПараметр("ТЧ",ТЧ);  
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Если НЕ РезультатЗапроса.Пустой() Тогда 
	//	ПрошлаПроверкаУспешно = Ложь;
	//	Сообщить("Ошибка! Серийных номеров нет на остатках:");
	//КонецЕсли;
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Пока Выборка.Следующий() Цикл
	//	НайденныеСтроки = ТЧ.НайтиСтроки(Новый Структура("СерийныйНомер",Выборка.СерийныйНомер)); 
	//	Для Каждого стр ИЗ НайденныеСтроки Цикл  
	//		ИндексСтроки = стр.НомерСтроки-1; 
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("В строке № %1 пакет: %2",стр.НомерСтроки,стр.СерийныйНомер),,стр);
	//	КонецЦикла;	
	//КонецЦикла;
	//\\ 
	
	//не привязан ли уже к адд
	ПакетыПоЭтомуАдд = ДобавляемыеПакеты.НайтиСтроки(Новый Структура("ТекущийАддендум",Объект.Аддендум));  
	
	Если НЕ ПакетыПоЭтомуАдд.Количество() = 0 Тогда  
		ПрошлаПроверкаУспешно = Ложь; 
		Если ЗначениеЗаполнено(Объект.Аддендум) Тогда 
			Сообщить("Ошибка! Серийные номера уже привязаны к аддендуму:");
		Иначе     
			Сообщить("Ошибка! Серийные номера уже отвязаны от аддендума:");
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого стр ИЗ ПакетыПоЭтомуАдд Цикл  
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("В строке № %1 пакет: %2",стр.НомерСтроки,стр.СерийныйНомер),,стр);
	КонецЦикла; 
	//\\
	
	//проверка на дубли 
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЧ.СерийныйНомер
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	&ТЧ КАК ТЧ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.СерийныйНомер
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВТ.СерийныйНомер КАК СерийныйНомер,
	               |		СУММА(1) КАК Количество
	               |	ИЗ
	               |		ВТ КАК ВТ
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ВТ.СерийныйНомер) КАК ВложенныйЗапрос
	               |ГДЕ
	               |	ВложенныйЗапрос.Количество > 1";
	Запрос.УстановитьПараметр("ТЧ",ТЧ);
	
	РезЗ = Запрос.Выполнить();
	
	Если НЕ РезЗ.Пустой() Тогда   
		Сообщить("Ошибка! Дублирование серийных номеров:"); 
		ПрошлаПроверкаУспешно = Ложь;
	КонецЕсли;
	
	Выборка = РезЗ.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Дублирования = ДобавляемыеПакеты.НайтиСтроки(Новый Структура("СерийныйНомер",Выборка.СерийныйНомер));
		
		Для Каждого стр ИЗ Дублирования Цикл  
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("В строке № %1 пакет: %2",стр.НомерСтроки,стр.СерийныйНомер),,стр);
		КонецЦикла; 
	КонецЦикла;
	//\\  
	
	//проверка на соотвествие заказу и назначение идентификатора и остатки 
	ДанныеПоИдентификаторам = УстановитьИдентификаторТовараАддендума(Объект.Аддендум,ТЧ.ВыгрузитьКолонку("СерийныйНомер"));  
	
	Для Каждого стр ИЗ ТЧ Цикл 
		
		Запись = ДанныеПоИдентификаторам.Найти(стр.СерийныйНомер,"СерийныйНомер");
		Если Запись = Неопределено Тогда   
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Ошибка! В строке № %1 серийного номера %2 нет на остатках.",стр.НомерСтроки,стр.СерийныйНомер),,стр);
			ПрошлаПроверкаУспешно = Ложь;
		ИначеЕсли ЗначениеЗаполнено(Объект.Аддендум) И НЕ ЗначениеЗаполнено(Запись.ИдентификаторТовара) тогда	
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Ошибка! В строке № %1 для серийного номера %2 в документе %3 не определены подходящие условия. Проверьте соответствие состава пакета и требования заказа", 
			стр.НомерСтроки,стр.СерийныйНомер, Объект.Аддендум),,стр.СерийныйНомер); 
			ПрошлаПроверкаУспешно = Ложь;
		Иначе
			стр.ИдентификаторТовара = Запись.ИдентификаторТовара;
		КонецЕсли;
		
	КонецЦикла;
	//\\
	
	ТЧ = Неопределено; //так как на клиент нельзя передать таблицу
		
КонецПроцедуры 

&НаКлиенте
Процедура ОчиститьДобавялемыеПакетыИМаску()  
	Элементы.Маска.СписокВыбора.Очистить(); 
	Маска = "";
	Элементы.Маска.ТолькоПросмотр = Ложь;
	ДобавляемыеПакеты.Очистить(); 
	ПересчитатьИтогДобавляемыхПакетов();
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииМаски(Результат,ДопПараметры) Экспорт  
	
	Если НЕ Результат = КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	ДобавляемыеПакеты.Очистить();
	ПересчитатьИтогДобавляемыхПакетов();
			
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииНомераПакета(ПоНомеруПакета,НомерПакета,НомерСтроки)   
	
	Если ПоНомеруПакета Тогда  
		ДанныеПоПакету = ПолучитьДанныеПоПакету(НомерПакета);  //по номеру пакета
	Иначе
		ДанныеПоПакету = ПолучитьДанныеПоСНПакета(НомерПакета); //по серийному номеру   
	КонецЕсли;
		
	//если нет на остатках
	Если ДанныеПоПакету = Неопределено Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("В строке № %1 пакета %2 нет на остатках! Проверьте правильность заполнения номера.",НомерСтроки,НомерПакета),,"ДобавляемыеПакеты["+"НомерСтроки-1"+"]");
		Возврат;
	КонецЕсли; 
	//\\
	
	ЗаполнитьЗначенияСвойств(ДобавляемыеПакеты[НомерСтроки-1],ДанныеПоПакету);  
	
	Дублирования = ДобавляемыеПакеты.НайтиСтроки(Новый Структура("СерийныйНомер",ДанныеПоПакету.СерийныйНомер)); 
	
	//уже привязан/отвязан к/от адд или есть в тч
	Если ДанныеПоПакету.ТекущийАддендум = Объект.Аддендум ИЛИ Дублирования.Количество() > 1 Тогда   
		Если ДанныеПоПакету.ТекущийАддендум = Объект.Аддендум Тогда  
			Если ЗначениеЗаполнено(Объект.Аддендум) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("В строке № %1 пакет %2 уже привязан к данному аддендуму!",НомерСтроки,ДанныеПоПакету.СерийныйНомер),,"ДобавляемыеПакеты["+"НомерСтроки-1"+"]");
			Иначе 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("В строке № %1 пакет %2 уже отвязан от аддендума!",НомерСтроки,ДанныеПоПакету.СерийныйНомер),,"ДобавляемыеПакеты["+"НомерСтроки-1"+"]");
			КонецЕсли;
		КонецЕсли;
		Если Дублирования.Количество() > 1 Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("В строке № %1 пакет %2 уже есть в табличной части!",НомерСтроки,ДанныеПоПакету.СерийныйНомер),,"ДобавляемыеПакеты["+"НомерСтроки-1"+"]");
		КонецЕсли;
	КонецЕсли; 
	//\\  
	
	ПересчитатьИтогДобавляемыхПакетов(); 
	
	Если НЕ ЗначениеЗаполнено(Объект.Аддендум) Тогда 
		Возврат;
	КонецЕсли;

	МассивСерийныйНомер = Новый Массив;
	МассивСерийныйНомер.Добавить(ДанныеПоПакету.СерийныйНомер);
	
	Результат = УстановитьИдентификаторТовараАддендума(Объект.Аддендум,МассивСерийныйНомер);
	
	//Скорее всего выделили криво строки
	Если Результат.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли; 
	//\\
	
	Если НЕ ЗначениеЗаполнено(Результат[0].ИдентификаторТовара) Тогда	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Ошибка! В строке № %1 для серийного номера %2 в документе %3 не определены подходящие условия. Проверьте соответствие состава пакета и требования заказа", 
		НомерСтроки,ДанныеПоПакету.СерийныйНомер, Объект.Аддендум),,"ДобавляемыеПакеты["+"НомерСтроки-1"+"]");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеПодбораСерийногоНомера(Результат, ДополнительныеПараметры) Экспорт  
		
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.ДобавляемыеПакеты.ТекущиеДанные;
	
	НомерСтроки = ТекДанные.НомерСтроки;  
	Для Каждого стр ИЗ Результат Цикл 
		ПриИзмененииНомераПакета(Ложь,стр,НомерСтроки);
	КонецЦикла;
		
КонецПроцедуры 

&НаКлиенте
Процедура ОткрытьФормуВыбораСН()
	Если ЗначениеЗаполнено(Объект.Аддендум) Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("РежимВыбора"			, Истина);
		ПараметрыФормы.Вставить("МножественныйВыбор"	, Истина);
		ПараметрыФормы.Вставить("ЗакрыватьПриВыборе"	, Ложь);
		ПараметрыФормы.Вставить("Аддендум"				, Объект.Аддендум);
		//ПараметрыФормы.Вставить("ИдентификаторТовара"	, Элементы.Товары.ТекущиеДанные.ИдентификаторТовара);
		ПараметрыФормы.Вставить("Номенклатура"			, Объект.Номенклатура);
		
		ОткрытьФорму("Обработка.алк_РМ_ПривязкаПакетовКАддендуму_2_0.Форма.ФормаПодбораСерийногоНомера", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("РежимВыбора",Истина);
		ПараметрыФормы.Вставить("МножественныйВыбор",Истина);
		ПараметрыФормы.Вставить("ЗакрыватьПриВыборе",Ложь);
		ПараметрыФормы.Вставить("ТолькоСОстатками", Истина); 
		ПараметрыФормы.Вставить("СтруктурнаяЕдиницаДобавитьОтбор", Истина); 
		ПараметрыФормы.Вставить("ШтабельДобавитьОтбор", Истина); 
		ПараметрыФормы.Вставить("АддендумОтбор", Истина); 
		Если Объект.Участок = ПолучитьРазрешенныеУчастки("000000038") ИЛИ Объект.Участок = ПолучитьРазрешенныеУчастки("000000043") Тогда //СГП Шпон 
			Номенклатура = ВернутьСписокНомеменклатур();
		Иначе
			Номенклатура = Объект.Номенклатура;
		КонецЕсли;
		ПараметрыФормы.Вставить("Номенклатура", Номенклатура);
		
		ОткрытьФорму("Справочник.СерийныеНомера.ФормаВыбора",ПараметрыФормы,ЭтаФорма);
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти


#Область Функции

&НаСервереБезКонтекста
Функция ПолучитьНоменклатуруИзАддендума(Аддендум)   
	Возврат Аддендум.Товары[0].Номенклатура;	
КонецФункции

&НаСервереБезКонтекста
Функция ВернутьТЗСДаннымиПоАдд(ТЗ)
	//получаем адд для пакетов
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ.СерийныйНомер,
	               |	ТЗ.Характеристика,
	               |	ТЗ.Количество
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	&ТЗ КАК ТЗ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.СерийныйНомер,
	               |	ВТ.Характеристика,
	               |	ВТ.Количество,
	               |	ЕСТЬNULL(алк_ПакетыПоАддендумамСрезПоследних.Аддендум, ЗНАЧЕНИЕ(Документ.алк_Аддендумы.ПустаяСсылка)) КАК ТекущийАддендум,
	               |	ЕСТЬNULL(алк_ПакетыПоАддендумамСрезПоследних.ИдентификаторТовара, """") КАК ИдентификаторТовара
	               |ИЗ
	               |	ВТ КАК ВТ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПакетыПоАддендумам.СрезПоследних(
	               |				,
	               |				СерийныйНомер В
	               |					(ВЫБРАТЬ
	               |						ВТ.СерийныйНомер
	               |					ИЗ
	               |						ВТ КАК ВТ)) КАК алк_ПакетыПоАддендумамСрезПоследних
	               |		ПО ВТ.СерийныйНомер = алк_ПакетыПоАддендумамСрезПоследних.СерийныйНомер
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ.СерийныйНомер,
	               |	ВТ.Характеристика,
	               |	ВТ.Количество,
	               |	ЕСТЬNULL(алк_ПакетыПоАддендумамСрезПоследних.Аддендум, ЗНАЧЕНИЕ(Документ.алк_Аддендумы.ПустаяСсылка)),
	               |	ЕСТЬNULL(алк_ПакетыПоАддендумамСрезПоследних.ИдентификаторТовара, """")"; 
	Запрос.УстановитьПараметр("ТЗ",ТЗ);
	
	Возврат Запрос.Выполнить().Выгрузить();
	//\\   	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьРазрешенныеУчастки(КодУчастка)
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ РАЗРЕШЕННЫЕ
	              |	алк_Участки.Ссылка
	              |ИЗ
	              |	Справочник.алк_Участки КАК алк_Участки
	              |ГДЕ
	              |	алк_Участки.Код = &Код";
	Запрос.УстановитьПараметр("Код",КодУчастка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	Возврат Справочники.алк_Участки.ПустаяСсылка();
КонецФункции

&НаСервереБезКонтекста
Функция УстановитьНоменклатуруКарандаш() 
	Возврат Справочники.Номенклатура.НайтиПоКоду("ПБ-00000006");	
КонецФункции

//по номеру пакета
&НаСервере
Функция ПолучитьДанныеПоПакету(НомерПакета) 
	
	//получение номера пакета
	Значение = СтрЗаменить(Формат(НомерПакета, "ЧГ="), " ", "");
	НадоНулей = 6 - СтрДлина(Значение); 
	Если НадоНулей = 0 Тогда 
		НомерПакетаСНулями = Значение; 
	Иначе 
		НомерПакетаСНулями = Формат(0,"ЧЦ="+НадоНулей+";ЧН=; ЧВН=; ЧГ=0") + Значение;
	КонецЕсли;
	//\\   
	
	Год = Формат(ГодПакета,"ДФ=yy");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	алк_ОстаткиЗапасовОстатки.СерийныйНомер,
	               |	алк_ОстаткиЗапасовОстатки.Характеристика,
	               |	алк_ОстаткиЗапасовОстатки.КоличествоОстаток КАК Количество,
	               |	ЕСТЬNULL(алк_ПакетыПоАддендумамСрезПоследних.Аддендум, ЗНАЧЕНИЕ(Документ.алк_Аддендумы.ПустаяСсылка)) КАК ТекущийАддендум,
	               |	ЕСТЬNULL(алк_ПакетыПоАддендумамСрезПоследних.ИдентификаторТовара, """") КАК ИдентификаторТовара
	               |ИЗ
	               |	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(, СерийныйНомер.Наименование ПОДОБНО &Маска + ""-"" + &Год + ""-"" + &НомерПакета) КАК алк_ОстаткиЗапасовОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПакетыПоАддендумам.СрезПоследних КАК алк_ПакетыПоАддендумамСрезПоследних
	               |		ПО алк_ОстаткиЗапасовОстатки.СерийныйНомер = алк_ПакетыПоАддендумамСрезПоследних.СерийныйНомер";
	Запрос.УстановитьПараметр("Маска",Маска);
	Запрос.УстановитьПараметр("Год",Год);
	Запрос.УстановитьПараметр("НомерПакета",НомерПакетаСНулями);  
	
	РезЗ = Запрос.Выполнить(); 
	Если РезЗ.Пустой() Тогда
		НомерПакета = Маска + "-" + Год + "-" + НомерПакетаСНулями; 
		Возврат Неопределено;
	КонецЕсли; 
	
	ТЗ = РезЗ.Выгрузить();
	Строка = Новый Структура("СерийныйНомер,Характеристика,Количество,ТекущийАддендум,ИдентификаторТовара"); 
	ЗаполнитьЗначенияСвойств(Строка,ТЗ[0]);

	Возврат Строка; 
	
КонецФункции

//по серийному номеру пакета
&НаСервере
Функция ПолучитьДанныеПоСНПакета(СерийныйНомер) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	алк_ОстаткиЗапасовОстатки.СерийныйНомер,
	               |	алк_ОстаткиЗапасовОстатки.Характеристика,
	               |	алк_ОстаткиЗапасовОстатки.КоличествоОстаток КАК Количество,
	               |	ЕСТЬNULL(алк_ПакетыПоАддендумамСрезПоследних.Аддендум, ЗНАЧЕНИЕ(Документ.алк_Аддендумы.ПустаяСсылка)) КАК ТекущийАддендум,
	               |	ЕСТЬNULL(алк_ПакетыПоАддендумамСрезПоследних.ИдентификаторТовара, """") КАК ИдентификаторТовара
	               |ИЗ
	               |	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(, СерийныйНомер = &СерийныйНомер) КАК алк_ОстаткиЗапасовОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПакетыПоАддендумам.СрезПоследних КАК алк_ПакетыПоАддендумамСрезПоследних
	               |		ПО алк_ОстаткиЗапасовОстатки.СерийныйНомер = алк_ПакетыПоАддендумамСрезПоследних.СерийныйНомер";
	Запрос.УстановитьПараметр("СерийныйНомер",СерийныйНомер);
	
	РезЗ = Запрос.Выполнить(); 
	Если РезЗ.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	ТЗ = РезЗ.Выгрузить();
	Строка = Новый Структура("СерийныйНомер,Характеристика,Количество,ТекущийАддендум,ИдентификаторТовара"); 
	ЗаполнитьЗначенияСвойств(Строка,ТЗ[0]);

	Возврат Строка; 
	
КонецФункции

//возвращает тз
&НаСервереБезКонтекста
Функция УстановитьИдентификаторТовараАддендума(Аддендум,МассивСерийныхНомеров) 		
	Возврат Документы.алк_Аддендумы.ПолучитьИдентификаторыТоваровДляСерийныхНомеров(Аддендум,МассивСерийныхНомеров, ТекущаяДата()); 		
КонецФункции

&НаСервере
Функция ВернутьСписокНомеменклатур()
	
	СписокНоменклатур = Новый СписокЗначений;	
	
	Если Карандаши = 1 Или Карандаши = 3 Тогда
		СписокНоменклатур.Добавить(УстановитьНоменклатуруКарандаш());	
	КонецЕсли;               
	
	Если Карандаши = 1 Или Карандаши = 2 Тогда
		СписокНоменклатур.Добавить(Объект.Номенклатура);	
	КонецЕсли;                     
	 
	Возврат СписокНоменклатур; 
	
КонецФункции

#КонецОбласти


#Область Команды

&НаКлиенте
Процедура ПривязатьПакет(Команда)   
	Если Объект.Участок = ПолучитьРазрешенныеУчастки("000000040") Тогда  //СГП ПМ  
		Элементы.Маска.СписокВыбора.Добавить("ПМ");
		Элементы.Маска.СписокВыбора.Добавить("МЛ");
		Элементы.Маска.СписокВыбора.Добавить("НЗ"); 
		Маска = "ПМ";
	ИначеЕсли Объект.Участок = ПолучитьРазрешенныеУчастки("000000039") Тогда  //СГП ДГ  
		Элементы.Маска.СписокВыбора.Добавить("ДГ");
		Маска = "ДГ";
		Элементы.Маска.ТолькоПросмотр = Истина;
	Иначе   
		Маска = "ШП";
		Если ЗначениеЗаполнено(Объект.Аддендум) Тогда 
			Если Объект.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.Шпон") Тогда 
				Элементы.Маска.СписокВыбора.Добавить("ШП"); 
				Элементы.Маска.ТолькоПросмотр = Истина;
			Иначе
				Элементы.Маска.СписокВыбора.Добавить("КШ");  
				Элементы.Маска.ТолькоПросмотр = Истина;
				Маска = "КШ";
			КонецЕсли;
		Иначе  
			Элементы.Маска.СписокВыбора.Добавить("ШП");
			Элементы.Маска.СписокВыбора.Добавить("КШ");
		КонецЕсли;	
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ГодПакета) Тогда 
		ГодПакета = НачалоГода(ТекущаяДата()); 
	КонецЕсли;
	РедактированиеФормыПриПередПривязкой(Истина);
КонецПроцедуры

&НаКлиенте
Асинх Процедура СохранитьИзменения(Команда)
	
	ПустыеСтроки = ДобавляемыеПакеты.НайтиСтроки(Новый Структура("СерийныйНомер",ПредопределенноеЗначение("Справочник.СерийныеНомера.ПустаяСсылка")));
	Для Каждого стр ИЗ ПустыеСтроки Цикл  
		ДобавляемыеПакеты.Удалить(стр);
	КонецЦикла;
	
	Если ДобавляемыеПакеты.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;  
	
	Если НЕ ПустыеСтроки.Количество() = 0 Тогда //придется перенумеровать строки, так как пустые удалили
		НомерСтроки = 1;	
		Для Каждого стр ИЗ ДобавляемыеПакеты Цикл
			стр.НомерСтроки = НомерСтроки;
			НомерСтроки = НомерСтроки+1;
		КонецЦикла;;
	КонецЕсли;
	
	//контрольная проверка на остатки и что не привязано к этому адд 
	ПрошлаПроверкаУспешно = Истина; 
	Контроль(Неопределено,ПрошлаПроверкаУспешно);
	Если НЕ ПрошлаПроверкаУспешно Тогда 
		Возврат;
	КонецЕсли;
	//\\
		
	ОчиститьСообщения();
	
	ПараметрыСменыПоТекущейДате = РфпПолучениеДанныхСервер.ПолучитьПараметрыСменыПоДате(Объект.Участок);
	
	Если ПроверитьЗаполнение()
		И Объект.ДатаСмены = НачалоДня(ПараметрыСменыПоТекущейДате.ДатаСмены) 
		И Объект.Смена = ПараметрыСменыПоТекущейДате.Смена Тогда 			
		СохранитьНаСервере();
		Если Успех Тогда
			УспешннаяПривязкаКАдд();
			ВопросАсинх("", РежимДиалогаВопрос.ОК, 5, КодВозвратаДиалога.ОК , "Пакеты привязаны/отвязаны к аддендуму", КодВозвратаДиалога.ОК);
			Модифицированность = Ложь;
		КонецЕсли;
	Иначе 
		Если ПараметрыСменыПоТекущейДате <> NULL Тогда 
			ЗаполнитьЗначенияСвойств(Объект, ПараметрыСменыПоТекущейДате, "ДатаСмены, Смена"); 
		КонецЕсли;
		ВопросАсинх("Ошибка. Проверьте параметры рабочего места и повторно нажмите кнопку ""Сохранить"".", РежимДиалогаВопрос.ОК, , КодВозвратаДиалога.ОК , "Началась новая смена", КодВозвратаДиалога.ОК);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьИзменения(Команда) 
	ОчиститьДобавялемыеПакетыИМаску();
	РедактированиеФормыПриПередПривязкой(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСерийнымиНомерамиПоПроизводству(Команда) 
	ЗаполнитьПоДокументуКоманда(Ложь,Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСерийнымиНомерамиПоПеремещению(Команда)
	ЗаполнитьПоДокументуКоманда(Истина,Ложь);	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСерийнымиНомерамиПоПеремещениюЗапасов(Команда)
	ЗаполнитьПоДокументуКоманда(Ложь,Истина);
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	ОткрытьФормуВыбораСН();
КонецПроцедуры



#КонецОбласти
